Revit 2024 API
ToggleButtonData Constructor (String, String, String, String)
Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ToggleButtonData(
	string name,
	string text,
	string assemblyName,
	string className
)
Visual Basic
Public Sub New ( _
	name As String, _
	text As String, _
	assemblyName As String, _
	className As String _
)
Visual C++
public:
ToggleButtonData(
	String^ name,
	String^ text,
	String^ assemblyName,
	String^ className
)
Parameters
name
Type: System.String
The internal name of the new button.
text
Type: System.String
The user visible text seen on the new button.
assemblyName
Type: System.String
The assembly path of the button.
className
Type: System.String
The name of the class containing the implementation for the command.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | Thrown when null is passed for one or more arguments.
Autodesk.Revit.Exceptions.ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
ToggleButtonData Class
ToggleButtonData Overload
Autodesk.Revit.UI Namespace